GopalSaraf/Practicals/PSDL/include/proc/pic18lf458.inc
// Register: RXB0D3
#define RXB0D3 RXB0D3
RXB0D3                                   equ 0F69h
// bitfield definitions
RXB0D3_RXB0D30_POSN                      equ 0000h
RXB0D3_RXB0D30_POSITION                  equ 0000h
RXB0D3_RXB0D30_SIZE                      equ 0001h
RXB0D3_RXB0D30_LENGTH                    equ 0001h
RXB0D3_RXB0D30_MASK                      equ 0001h
RXB0D3_RXB0D31_POSN                      equ 0001h
RXB0D3_RXB0D31_POSITION                  equ 0001h
RXB0D3_RXB0D31_SIZE                      equ 0001h
RXB0D3_RXB0D31_LENGTH                    equ 0001h
RXB0D3_RXB0D31_MASK                      equ 0002h
RXB0D3_RXB0D32_POSN                      equ 0002h
RXB0D3_RXB0D32_POSITION                  equ 0002h
RXB0D3_RXB0D32_SIZE                      equ 0001h
RXB0D3_RXB0D32_LENGTH                    equ 0001h
RXB0D3_RXB0D32_MASK                      equ 0004h
RXB0D3_RXB0D33_POSN                      equ 0003h
RXB0D3_RXB0D33_POSITION                  equ 0003h
RXB0D3_RXB0D33_SIZE                      equ 0001h
RXB0D3_RXB0D33_LENGTH                    equ 0001h
RXB0D3_RXB0D33_MASK                      equ 0008h
RXB0D3_RXB0D34_POSN                      equ 0004h
RXB0D3_RXB0D34_POSITION                  equ 0004h
RXB0D3_RXB0D34_SIZE                      equ 0001h
RXB0D3_RXB0D34_LENGTH                    equ 0001h
RXB0D3_RXB0D34_MASK                      equ 0010h
RXB0D3_RXB0D35_POSN                      equ 0005h
RXB0D3_RXB0D35_POSITION                  equ 0005h
RXB0D3_RXB0D35_SIZE                      equ 0001h
RXB0D3_RXB0D35_LENGTH                    equ 0001h
RXB0D3_RXB0D35_MASK                      equ 0020h
RXB0D3_RXB0D36_POSN                      equ 0006h
RXB0D3_RXB0D36_POSITION                  equ 0006h
RXB0D3_RXB0D36_SIZE                      equ 0001h
RXB0D3_RXB0D36_LENGTH                    equ 0001h
RXB0D3_RXB0D36_MASK                      equ 0040h
RXB0D3_RXB0D37_POSN                      equ 0007h
RXB0D3_RXB0D37_POSITION                  equ 0007h
RXB0D3_RXB0D37_SIZE                      equ 0001h
RXB0D3_RXB0D37_LENGTH                    equ 0001h
RXB0D3_RXB0D37_MASK                      equ 0080h
RXB0D3_RB0D30_POSN                       equ 0000h
RXB0D3_RB0D30_POSITION                   equ 0000h
RXB0D3_RB0D30_SIZE                       equ 0001h
RXB0D3_RB0D30_LENGTH                     equ 0001h
RXB0D3_RB0D30_MASK                       equ 0001h
RXB0D3_RB0D31_POSN                       equ 0001h
RXB0D3_RB0D31_POSITION                   equ 0001h
RXB0D3_RB0D31_SIZE                       equ 0001h
RXB0D3_RB0D31_LENGTH                     equ 0001h
RXB0D3_RB0D31_MASK                       equ 0002h
RXB0D3_RB0D32_POSN                       equ 0002h
RXB0D3_RB0D32_POSITION                   equ 0002h
RXB0D3_RB0D32_SIZE                       equ 0001h
RXB0D3_RB0D32_LENGTH                     equ 0001h
RXB0D3_RB0D32_MASK                       equ 0004h
RXB0D3_RB0D33_POSN                       equ 0003h
RXB0D3_RB0D33_POSITION                   equ 0003h
RXB0D3_RB0D33_SIZE                       equ 0001h
RXB0D3_RB0D33_LENGTH                     equ 0001h
RXB0D3_RB0D33_MASK                       equ 0008h
RXB0D3_RB0D34_POSN                       equ 0004h
RXB0D3_RB0D34_POSITION                   equ 0004h
RXB0D3_RB0D34_SIZE                       equ 0001h
RXB0D3_RB0D34_LENGTH                     equ 0001h
RXB0D3_RB0D34_MASK                       equ 0010h
RXB0D3_RB0D35_POSN                       equ 0005h
RXB0D3_RB0D35_POSITION                   equ 0005h
RXB0D3_RB0D35_SIZE                       equ 0001h
RXB0D3_RB0D35_LENGTH                     equ 0001h
RXB0D3_RB0D35_MASK                       equ 0020h
RXB0D3_RB0D36_POSN                       equ 0006h
RXB0D3_RB0D36_POSITION                   equ 0006h
RXB0D3_RB0D36_SIZE                       equ 0001h
RXB0D3_RB0D36_LENGTH                     equ 0001h
RXB0D3_RB0D36_MASK                       equ 0040h
RXB0D3_RB0D37_POSN                       equ 0007h
RXB0D3_RB0D37_POSITION                   equ 0007h
RXB0D3_RB0D37_SIZE                       equ 0001h
RXB0D3_RB0D37_LENGTH                     equ 0001h
RXB0D3_RB0D37_MASK                       equ 0080h

// Register: RXB0D4
#define RXB0D4 RXB0D4
RXB0D4                                   equ 0F6Ah
// bitfield definitions
RXB0D4_RXB0D40_POSN                      equ 0000h
RXB0D4_RXB0D40_POSITION                  equ 0000h
RXB0D4_RXB0D40_SIZE                      equ 0001h
RXB0D4_RXB0D40_LENGTH                    equ 0001h
RXB0D4_RXB0D40_MASK                      equ 0001h
RXB0D4_RXB0D41_POSN                      equ 0001h
RXB0D4_RXB0D41_POSITION                  equ 0001h
RXB0D4_RXB0D41_SIZE                      equ 0001h
RXB0D4_RXB0D41_LENGTH                    equ 0001h
RXB0D4_RXB0D41_MASK                      equ 0002h
RXB0D4_RXB0D42_POSN                      equ 0002h
RXB0D4_RXB0D42_POSITION                  equ 0002h
RXB0D4_RXB0D42_SIZE                      equ 0001h
RXB0D4_RXB0D42_LENGTH                    equ 0001h
RXB0D4_RXB0D42_MASK                      equ 0004h
RXB0D4_RXB0D43_POSN                      equ 0003h
RXB0D4_RXB0D43_POSITION                  equ 0003h
RXB0D4_RXB0D43_SIZE                      equ 0001h
RXB0D4_RXB0D43_LENGTH                    equ 0001h
RXB0D4_RXB0D43_MASK                      equ 0008h
RXB0D4_RXB0D44_POSN                      equ 0004h
RXB0D4_RXB0D44_POSITION                  equ 0004h
RXB0D4_RXB0D44_SIZE                      equ 0001h
RXB0D4_RXB0D44_LENGTH                    equ 0001h
RXB0D4_RXB0D44_MASK                      equ 0010h
RXB0D4_RXB0D45_POSN                      equ 0005h
RXB0D4_RXB0D45_POSITION                  equ 0005h
RXB0D4_RXB0D45_SIZE                      equ 0001h
RXB0D4_RXB0D45_LENGTH                    equ 0001h
RXB0D4_RXB0D45_MASK                      equ 0020h
RXB0D4_RXB0D46_POSN                      equ 0006h
RXB0D4_RXB0D46_POSITION                  equ 0006h
RXB0D4_RXB0D46_SIZE                      equ 0001h
RXB0D4_RXB0D46_LENGTH                    equ 0001h
RXB0D4_RXB0D46_MASK                      equ 0040h
RXB0D4_RXB0D47_POSN                      equ 0007h
RXB0D4_RXB0D47_POSITION                  equ 0007h
RXB0D4_RXB0D47_SIZE                      equ 0001h
RXB0D4_RXB0D47_LENGTH                    equ 0001h
RXB0D4_RXB0D47_MASK                      equ 0080h
RXB0D4_RB0D40_POSN                       equ 0000h
RXB0D4_RB0D40_POSITION                   equ 0000h
RXB0D4_RB0D40_SIZE                       equ 0001h
RXB0D4_RB0D40_LENGTH                     equ 0001h
RXB0D4_RB0D40_MASK                       equ 0001h
RXB0D4_RB0D41_POSN                       equ 0001h
RXB0D4_RB0D41_POSITION                   equ 0001h
RXB0D4_RB0D41_SIZE                       equ 0001h
RXB0D4_RB0D41_LENGTH                     equ 0001h
RXB0D4_RB0D41_MASK                       equ 0002h
RXB0D4_RB0D42_POSN                       equ 0002h
RXB0D4_RB0D42_POSITION                   equ 0002h
RXB0D4_RB0D42_SIZE                       equ 0001h
RXB0D4_RB0D42_LENGTH                     equ 0001h
RXB0D4_RB0D42_MASK                       equ 0004h
RXB0D4_RB0D43_POSN                       equ 0003h
RXB0D4_RB0D43_POSITION                   equ 0003h
RXB0D4_RB0D43_SIZE                       equ 0001h
RXB0D4_RB0D43_LENGTH                     equ 0001h
RXB0D4_RB0D43_MASK                       equ 0008h
RXB0D4_RB0D44_POSN                       equ 0004h
RXB0D4_RB0D44_POSITION                   equ 0004h
RXB0D4_RB0D44_SIZE                       equ 0001h
RXB0D4_RB0D44_LENGTH                     equ 0001h
RXB0D4_RB0D44_MASK                       equ 0010h
RXB0D4_RB0D45_POSN                       equ 0005h
RXB0D4_RB0D45_POSITION                   equ 0005h
RXB0D4_RB0D45_SIZE                       equ 0001h
RXB0D4_RB0D45_LENGTH                     equ 0001h
RXB0D4_RB0D45_MASK                       equ 0020h
RXB0D4_RB0D46_POSN                       equ 0006h
RXB0D4_RB0D46_POSITION                   equ 0006h
RXB0D4_RB0D46_SIZE                       equ 0001h
RXB0D4_RB0D46_LENGTH                     equ 0001h
RXB0D4_RB0D46_MASK                       equ 0040h
RXB0D4_RB0D47_POSN                       equ 0007h
RXB0D4_RB0D47_POSITION                   equ 0007h
RXB0D4_RB0D47_SIZE                       equ 0001h
RXB0D4_RB0D47_LENGTH                     equ 0001h
RXB0D4_RB0D47_MASK                       equ 0080h

// Register: RXB0D5
#define RXB0D5 RXB0D5
RXB0D5                                   equ 0F6Bh
// bitfield definitions
RXB0D5_RXB0D50_POSN                      equ 0000h
RXB0D5_RXB0D50_POSITION                  equ 0000h
RXB0D5_RXB0D50_SIZE                      equ 0001h
RXB0D5_RXB0D50_LENGTH                    equ 0001h
RXB0D5_RXB0D50_MASK                      equ 0001h
RXB0D5_RXB0D51_POSN                      equ 0001h
RXB0D5_RXB0D51_POSITION                  equ 0001h
RXB0D5_RXB0D51_SIZE                      equ 0001h
RXB0D5_RXB0D51_LENGTH                    equ 0001h
RXB0D5_RXB0D51_MASK                      equ 0002h
RXB0D5_RXB0D52_POSN                      equ 0002h
RXB0D5_RXB0D52_POSITION                  equ 0002h
RXB0D5_RXB0D52_SIZE                      equ 0001h
RXB0D5_RXB0D52_LENGTH                    equ 0001h
RXB0D5_RXB0D52_MASK                      equ 0004h
RXB0D5_RXB0D53_POSN                      equ 0003h
RXB0D5_RXB0D53_POSITION                  equ 0003h
RXB0D5_RXB0D53_SIZE                      equ 0001h
RXB0D5_RXB0D53_LENGTH                    equ 0001h
RXB0D5_RXB0D53_MASK                      equ 0008h
RXB0D5_RXB0D54_POSN                      equ 0004h
RXB0D5_RXB0D54_POSITION                  equ 0004h
RXB0D5_RXB0D54_SIZE                      equ 0001h
RXB0D5_RXB0D54_LENGTH                    equ 0001h
RXB0D5_RXB0D54_MASK                      equ 0010h
RXB0D5_RXB0D55_POSN                      equ 0005h
RXB0D5_RXB0D55_POSITION                  equ 0005h
RXB0D5_RXB0D55_SIZE                      equ 0001h
RXB0D5_RXB0D55_LENGTH                    equ 0001h
RXB0D5_RXB0D55_MASK                      equ 0020h
RXB0D5_RXB0D56_POSN                      equ 0006h
RXB0D5_RXB0D56_POSITION                  equ 0006h
RXB0D5_RXB0D56_SIZE                      equ 0001h
RXB0D5_RXB0D56_LENGTH                    equ 0001h
RXB0D5_RXB0D56_MASK                      equ 0040h
RXB0D5_RXB0D57_POSN                      equ 0007h
RXB0D5_RXB0D57_POSITION                  equ 0007h
RXB0D5_RXB0D57_SIZE                      equ 0001h
RXB0D5_RXB0D57_LENGTH                    equ 0001h
RXB0D5_RXB0D57_MASK                      equ 0080h
RXB0D5_RB0D50_POSN                       equ 0000h
RXB0D5_RB0D50_POSITION                   equ 0000h
RXB0D5_RB0D50_SIZE                       equ 0001h
RXB0D5_RB0D50_LENGTH                     equ 0001h
RXB0D5_RB0D50_MASK                       equ 0001h
RXB0D5_RB0D51_POSN                       equ 0001h
RXB0D5_RB0D51_POSITION                   equ 0001h
RXB0D5_RB0D51_SIZE                       equ 0001h
RXB0D5_RB0D51_LENGTH                     equ 0001h
RXB0D5_RB0D51_MASK                       equ 0002h
RXB0D5_RB0D52_POSN                       equ 0002h
RXB0D5_RB0D52_POSITION                   equ 0002h
RXB0D5_RB0D52_SIZE                       equ 0001h
RXB0D5_RB0D52_LENGTH                     equ 0001h
RXB0D5_RB0D52_MASK                       equ 0004h
RXB0D5_RB0D53_POSN                       equ 0003h
RXB0D5_RB0D53_POSITION                   equ 0003h
RXB0D5_RB0D53_SIZE                       equ 0001h
RXB0D5_RB0D53_LENGTH                     equ 0001h
RXB0D5_RB0D53_MASK                       equ 0008h
RXB0D5_RB0D54_POSN                       equ 0004h
RXB0D5_RB0D54_POSITION                   equ 0004h
RXB0D5_RB0D54_SIZE                       equ 0001h
RXB0D5_RB0D54_LENGTH                     equ 0001h
RXB0D5_RB0D54_MASK                       equ 0010h
RXB0D5_RB0D55_POSN                       equ 0005h
RXB0D5_RB0D55_POSITION                   equ 0005h
RXB0D5_RB0D55_SIZE                       equ 0001h
RXB0D5_RB0D55_LENGTH                     equ 0001h
RXB0D5_RB0D55_MASK                       equ 0020h
RXB0D5_RB0D56_POSN                       equ 0006h
RXB0D5_RB0D56_POSITION                   equ 0006h
RXB0D5_RB0D56_SIZE                       equ 0001h
RXB0D5_RB0D56_LENGTH                     equ 0001h
RXB0D5_RB0D56_MASK                       equ 0040h
RXB0D5_RB0D57_POSN                       equ 0007h
RXB0D5_RB0D57_POSITION                   equ 0007h
RXB0D5_RB0D57_SIZE                       equ 0001h
RXB0D5_RB0D57_LENGTH                     equ 0001h
RXB0D5_RB0D57_MASK                       equ 0080h

